# Pass strings into dictionary

In [4]:
import pandas as pd

In [5]:
items = {'Name':'Abhi' , 'Class' : 'B.Tech(CSE)' , 'Roll no.:':11002020}
df = pd.DataFrame(items)

ValueError: If using all scalar values, you must pass an index

In [ ]:
df

In [28]:
items = {'Name' : ['Abhi'], 'Class' : ['B.Tech(cse)'], 'Roll_no' : ['20107002']}
items

{'Name': ['Abhi'], 'Class': ['B.Tech(cse)'], 'Roll_no': ['20107002']}

In [29]:
dfr = pd.DataFrame(items)

In [30]:
dfr

   Name        Class   Roll_no
0  Abhi  B.Tech(cse)  20107002

In [7]:
a = pd.Series([1, 1, 1, 2], index=['a', 'b', 'c', 'd'])
a

a    1
b    1
c    1
d    2
dtype: int64

# Creating a Pandas dataframe using list of tuples

In [9]:
data = [('Peter', 18, 7),
        ('Riff', 15, 6),
        ('John', 17, 8),
        ('Michel', 18, 7),
        ('Sheli', 17, 5) ]

In [10]:
df = pd.DataFrame(data)

In [11]:
df

        0   1  2
0   Peter  18  7
1    Riff  15  6
2    John  17  8
3  Michel  18  7
4   Sheli  17  5

In [13]:
#Add column name
df = pd.DataFrame(data, columns =['Name', 'Age', 'Score'])

In [14]:
df

     Name  Age  Score
0   Peter   18      7
1    Riff   15      6
2    John   17      8
3  Michel   18      7
4   Sheli   17      5

 Using from_records()

In [15]:
df = pd.DataFrame.from_records(data, columns =['Name', 'Age', 'Score'])

In [16]:
df

     Name  Age  Score
0   Peter   18      7
1    Riff   15      6
2    John   17      8
3  Michel   18      7
4   Sheli   17      5

In [18]:
# : Using from_items()

  
# data in the form of list of tuples
data = [
('Age', [18, 15, 17, 18, 17]),
('Team', ['A', 'B', 'A', 'C', 'B']),
('Score', [7, 6, 8, 7, 5]),
]

In [19]:
data

[('Age', [18, 15, 17, 18, 17]),
 ('Team', ['A', 'B', 'A', 'C', 'B']),
 ('Score', [7, 6, 8, 7, 5])]

In [20]:
df1 = pd.DataFrame(data)
df1

       0                     1
0    Age  [18, 15, 17, 18, 17]
1   Team       [A, B, A, C, B]
2  Score       [7, 6, 8, 7, 5]

In [24]:
df1 = pd.DataFrame.from_items(data)

AttributeError: type object 'DataFrame' has no attribute 'from_items'

# List inside list

In [29]:
lst = [['tom', 25 , 34 ], ['krish', 30 , 85],
       ['nick', 26 , 70], ['juli', 22 , 80]]
    
df = pd.DataFrame(lst, columns =['Name', 'Age' , 'Percentage'])
df

    Name  Age  Percentage
0    tom   25          34
1  krish   30          85
2   nick   26          70
3   juli   22          80

In [31]:
df = pd.DataFrame(lst, columns =['Name', 'Age', 'Percentage'], dtype = float)
df

C:\Users\bakhshi\AppData\Local\Temp\ipykernel_10908\17279123.py:1: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df = pd.DataFrame(lst, columns =['Name', 'Age', 'Percentage'], dtype = float)

    Name   Age  Percentage
0    tom  25.0        34.0
1  krish  30.0        85.0
2   nick  26.0        70.0
3   juli  22.0        80.0

In [32]:
# Using lists in dictionary to create dataframe

  
# list of name, degree, score
nme = ["aparna", "pankaj", "sudhir", "Geeku"]
deg = ["MBA", "BCA", "M.Tech", "MBA"]
scr = [90, 40, 80, 98]
  
# dictionary of lists 
dict = {'name': nme, 'degree': deg, 'score': scr} 
    
df = pd.DataFrame(dict)
    
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

# Create DataFrame from simple dictionary i.e dictionary with key and simple value like integer or string value.

In [33]:
details = {
    'Ankit' : 22,
    'Golu' : 21,
    'hacker' : 23
    }

In [34]:
# creating a Dataframe object from a list 
# of tuples of key, value pair
df = pd.DataFrame(list(details.items()))
  
df

        0   1
0   Ankit  22
1    Golu  21
2  hacker  23

In [35]:
# Nested dictionary
details = { 
    0 : {
        'Name' : 'Ankit',
        'Age' : 22,
        'University' : 'BHU'
        },
    1 : {
        'Name' : 'Aishwarya',
        'Age' : 21,
        'University' : 'JNU'
        },
    2 : {
        'Name' : 'Shaurya',
        'Age' : 23,
        'University' : 'DU'
        }
}

In [37]:
#  from nested dictionary
# in which inside dictionary
# key is act as index value
# and column value is 0, 1, 2...
df = pd.DataFrame(details)
df

                0          1        2
Name        Ankit  Aishwarya  Shaurya
Age            22         21       23
University    BHU        JNU       DU

In [38]:
#  swap the columns with indexes
df = df.transpose()
  
df

        Name Age University
0      Ankit  22        BHU
1  Aishwarya  21        JNU
2    Shaurya  23         DU

In [39]:
it={
 ('A', 'X'): 1,
 ('B', 'Y'): 2,
 ('C', 'Z'): 3
}

# Python dict with values as tuples to pandas DataFrame

In [42]:
td = {'A':(111,222), 'B':(333,444)}

In [43]:
f = pd.DataFrame(td)

In [44]:
f

     A    B
0  111  333
1  222  444

In [52]:
df = pd.DataFrame(td.items())

In [53]:
df

   0           1
0  A  (111, 222)
1  B  (333, 444)

In [54]:
td = {'q1':(111,222), 'q2':(333,444)}
pd.DataFrame(data=list(td.values()), index=list(td.keys()))

      0    1
q1  111  222
q2  333  444